import { TranslationContent } from "./types";

export const ua: TranslationContent = {
  header: {
    about: "About",
    schedule: "Schedule",
    q_and_a: "Q&A",
    reviews: "Reviews",
    contacts: "Contacts",
    certificate: "Certificate",
  },
  transparent: {
    first: "Welcome",
    second: "Hatha Flow",
    third: "Feel the universe",
  },
  about: {
    quote:
      "« I'm Irina Malyants, a certified yoga instructor with over 10 years of experience in yoga, and I invite you to join my classes in Barcelona. The practice will result in a calm mind, increased body awareness, a deeper connection with yourself and the world around you, as well as flexibility and endurance! Yoga classes are held in English and the group is international »",
    auther: "— Your Yoga Teacher, Irina Malyants",
  },
  schedule: {
    schedule: "Schedule",
    sessions: [
      {
        day: "Tuesday",
        time: "19:30 - 21:00",
        metro: "Diagonal",
        link: "https://maps.app.goo.gl/7WBFC6pGSf6DVFkT8",
      },
      {
        day: "Friday",
        time: "19:30 - 21:00",
        metro: "Diagonal",
        link: "https://maps.app.goo.gl/7WBFC6pGSf6DVFkT8",
      },
      {
        day: "Sunday",
        time: "12:15 - 13:45",
        metro: "Rocafort",
        link: "https://maps.app.goo.gl/LPucXx7Rv1Jqc74w6",
      },
    ],
  },
  locations: [
    {
      name: "ACADEMIA M",
      position: { lat: 41.377603, lng: 2.155058 },
      description: "Cozy yoga studio for 10 students",
      address: "Carrer de Sepúlveda, 57, L'Eixample, 08015 Barcelona",
      schedule: "Sunday: 12:15 - 13:45",
      link: "https://maps.app.goo.gl/LPucXx7Rv1Jqc74w6",
    },
    {
      name: "Yoga Club Barcelona",
      position: { lat: 41.3988579, lng: 2.1596346 },
      description: "New yoga studio for 20 students",
      address: "Carrer de Francisco Giner, 14, Grácia, 08012 Barcelona",
      schedule: "Tuesday & Friday: 19:30 - 21:00",
      link: "https://maps.app.goo.gl/7WBFC6pGSf6DVFkT8",
    },
  ],
  questionAnswers: [
    {
      question: "What is the Hatha Flow Yoga?",
      answers: [
        "Hatha Flow yoga combines static asanas with dynamic exercises, synchronized with breathing to build strength, flexibility, and balance :)",
      ],
    },
    {
      question: "What are the parts of the class?",
      answers: [
        "The class lasts 1.5 h and contains:",
        "The first part of Breathing Exercises and Meditation to set a calm mood and to center the mind.",
        "Then we proceed to the sequence of Asanas, targeting all muscle groups, combining dynamic movements with static poses, always focusing on the target zones.",
        "At the end of the practice, we will fully relax in Shavasana.",
      ],
    },
    {
      question: "What's the leve of the practicel?",
      answers: [
        "The level is open. It's perfect for beginners and I also suggest variations for the intermediate level.",
      ],
    },
    {
      question: "Is that okay if I've never done yoga before?",
      answers: [
        "Yes, of course. A lot of people with no experience in yoga come to my classes :) And actually they really enjoy them and start their journey in yoga.",
      ],
    },
  ],
  reviews: [
    {
      author: "Марія",
      stars: 5,
      text: "Відвідала заняття йоги з Іриною вперше і була абсолютно вражена дружньою та комфортною атмосферою, професіоналізмом тренера і відчуттям позитивних змін у тілі та розумі після заняття ❤️ Ірина пропонувала варіанти вправ як для початківців, так і для тих, хто має досвід у йозі, що зробило заняття зручним і продуктивним для всіх учасників 🌿",
    },
    {
      author: "Єкатерина",
      stars: 5,
      text: "Дуже дякую, Ірино, за мій перший клас йоги. Мені дуже сподобалась атмосфера — ми, килимки, зелена трава, захід сонця, гітарист, твій голос. Так спокійно ❤️❤️❤️ І дуже гарна компанія🫂",
    },
    {
      author: "Тетяна",
      stars: 5,
      text: "Це був ковток повітря в суєті робочих буднів, яких не буває кінця. Мені дуже сподобалось увага до дихання на початку і в кінці практики, обережний підхід, атмосфера та турбота. Дуже комфортний стан — є корисна фізична активність, але це не тягар, а радість. Я відчула, як розтягнулась кожна м'язова група в організмі і після цього вийшла відновленою. Дякую за ці півтори години турботи про себе 💜",
    },
    {
      author: "Тетяна",
      stars: 5,
      text: "Хочу залишити відгук подяки Ірині за наші душевні заняття по неділях. Я приходила до залу в різному настрої, а завжди йшла з чудовим розташуванням духу. Чудовий викладач, позитивна атмосфера. Моє тіло в захваті. Рекомендую від душі ❤️",
    },
    {
      author: "Євген",
      stars: 5,
      text: "Я дуже радий, що почав займатись йогою з Іриною. Вона чудовий учитель, який робить заняття цікавими і мотивуючими. Вона завжди створює затишну атмосферу, що допомагає мені розслабитись і повністю поринути в практику. Я помітив значне поліпшення моєї гнучкості, балансу і сили, і відчуваю себе більш енергійним після занять. З задоволенням рекомендую Ірину як викладача йоги.",
    },
    {
      author: "Софія",
      stars: 5,
      text: "Після йоги відчуття в тілі, як після лікувального масажу. Два години не здаються довгими, якщо налаштуватися, це відчувається, як повноцінний денний сон. Шия і спина відчувають себе чудово, деякі вправи роблю вдома, коли відчуваю біль у шиї. Приємний спорт, заспокійлива атмосфера, гарне самопочуття і повноцінний сон після заняття. Дуже подобаються дихальні вправи на початку заняття, навіть від цього у мене пройшов нежить. Загалом, рекомендую! Приємна компанія також додає привабливості :)",
    },
    {
      author: "Олександр",
      stars: 5,
      text: "Я ходжу на йогу до Ірини вже більше року. Кожне заняття наповнене як знайомими Асанами, що пронизують тіло вже відомою мені енергією, так і абсолютно новими рухами, що змушують задуматися і по-новому усвідомити можливості свого тіла. Відчуваю значні поліпшення в розтяжці, в якості життя і сну, в відчутті себе і природи навколо. Якщо ви хочете бути щасливими, здоровими і спокійними, вам необхідно відвідати уроки Ірини.",
    },
    {
      author: "Кирило",
      stars: 5,
      text: "Раніше ніколи не займався йогою. На групове заняття до Ірини прийшов за рекомендацією друзів і одразу зрозумів, що буду продовжувати займатися. Вже на першому занятті відчув, наскільки асиметрично розвинене тіло, стало зрозуміло, які м'язи потрібно працювати і на що звертати увагу. Також на йозі з Іриною можна звільнити голову від усіх думок і зосередитися на собі, своїх почуттях і відчуттях в моменті. Після кількох занять фізичний стан помітно покращився. Тепер намагаюся не пропускати заняття і всім рекомендую.",
    },
    {
      author: "Антон",
      stars: 5,
      text: "Мені було важко спочатку, тому що не було ніякої розтяжки. Але за два місяці ситуація значно покращилася завдяки постійним відвідуванням. Тепер, якщо пропускаю заняття, тіло починає просити йоги :) Мені дуже подобається розслабляюча атмосфера на занятті і приємна втома після. Здається, що і не сильно втомлюєшся під час заняття, але потім відчуваєш, що це все одно спорт!",
    },
    {
      author: "Анастасія",
      stars: 5,
      text: "Привіт! Мені дуже подобається йога! І твоя подача. Мені ідеально підходить формат зі статичними помірно силовими вправами і розтяжкою, при цьому немає довгих і нудних повторів одного і того ж. Після йоги я відчуваю внутрішнє розслаблення, спокій, але мої м'язи в тонусі.",
    },
    {
      author: "Олександра",
      stars: 5,
      text: "Доброго дня, Ірино! Хочемо залишити позитивний відгук про ваші заняття 🤗 Це перший досвід такої тривалої йоги для мене, але здається, що це абсолютно ідеально) Повільно, прорабатываючи кожну групу м'язів, дихання — те, що потрібно від справжньої йоги. Тренер Ірина дуже уважна, позитивна людина, добре пояснює всі асани, в цілому відчуваю себе завжди дуже комфортно на заняттях і, звісно, після них! Головний показник для мене — чоловік, який з радістю відвідував заняття разом зі мною 👍🏻",
    },
    {
      author: "Жанна",
      stars: 5,
      text: "Хотіла б сказати тобі велике спасибі! Я вирішила піти на йогу через часті болі в спині. Дуже подобається, спина стала боліти набагато рідше. На заняттях дуже дружня і приємна атмосфера) Дуже рекомендую ☺️❤️",
    },
    {
      author: "Максим",
      stars: 5,
      text: "Всім привіт! Хочу залишити надзвичайно позитивний відгук про такого класного майстра, як Ірина. Знаю, що вона займається йогою вже більше 10 років, навіть ходив з нею на деякі заняття. І ось в один прекрасний день так склалися обставини, що я зміг потрапити до неї на заняття, де вона виступала переді мною як інструктор. Йогою я займаюся не часто, але певний досвід у мене все ж є. І ось що хочу сказати, ефект після заняття з Іриною був приголомшливим. Під час сеансу було безліч цікавих поз, які дозволили мені розім'яти м'язи, про які я навіть не здогадувався. Я був на груповому сеансі, але Ірина змогла прослідкувати за кожним учасником і виправити всі помилки, щоб безпечно і правильно прийняти кожну позу. Після заняття кілька днів відчував легкість і емоційний підйом, якого я не зміг досягти на самостійних домашніх заняттях. Дуже шкода, що зараз через територіальну відстань немає можливості відвідувати її заняття. Тому всім раджу хоча б спробувати познайомитися з йогою з Іриною, але думаю, що на одному занятті ви не зупинитесь 😉",
    },
    {
      author: "Настя",
      stars: 5,
      text: "Що хочу сказати, я не дуже часто ходила на йогу, але маю з чим порівняти) з тобою було дуже затишно, від тебе відчувається відкритість і доброта, що дуже важливо для викладача йоги) на жаль, я ходила до тебе мало, але якби не відстань, продовжила б обов'язково) класно, що деякі вправи змінюються кожного разу, ще видно, що ти стежиш за всіма — це дуже мило😊 а ще у тебе супер заспокійливий голос, що теж дуже важливо в цій справі) дякую за знайомство🙏",
    },
  ],
};
